
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
import pandas as pd
import pickle
df= pd.read_csv('Trandata.csv')
cols = ['รับสถาณการณ์กดดันได้ดี',
       'ช่างสังเกต', 'ชอบทดลอง', 'รักอิสระ',
       'ละเอียดรอบคอบ', 'มีความสนใจในความรู้รอบตัว',
       'มีระเบียบวินัย', 'คนที่ทันคน', 'ชอบลองผิดลองถูก',
       'ชอบความท้าทาย', 'รักสนุก', 'รักการอ่าน', 'มีความเป็นตัวของตัวเองสูง',
       'ขี้ระแวง', 'เข้าสังคมเก่ง',
       'มีความหนักแน่นมั่นคง',
       'ไม่ชอบเที่ยวโลดโผน', 'ไม่ค่อยกล้าแสดงออก', 'ใจกว้าง',
       'ขี้เกรงใจคนอื่น']
df['รับสถาณการณ์กดดันได้ดี'] = df.รับสถาณการณ์กดดันได้ดี.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ช่างสังเกต'] = df.ช่างสังเกต.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ชอบทดลอง'] = df.ชอบทดลอง.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['รักอิสระ'] = df.รักอิสระ.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['นิยมธรรมชาติอนุรักษ์'] = df.นิยมธรรมชาติอนุรักษ์.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ละเอียดรอบคอบ'] = df.ละเอียดรอบคอบ.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['มีความสนใจในความรู้รอบตัว'] = df.มีความสนใจในความรู้รอบตัว.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['เจ้าคนนายคน'] = df.เจ้าคนนายคน.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['มีระเบียบวินัย'] = df.มีระเบียบวินัย.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['นิสัยไม่ยอมคน'] = df.นิสัยไม่ยอมคน.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['คนที่ทันคน'] = df.คนที่ทันคน.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ชอบลองผิดลองถูก'] = df.ชอบลองผิดลองถูก.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ชอบความท้าทาย'] = df.ชอบความท้าทาย.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['รักสนุก'] = df.รักสนุก.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['รักการอ่าน'] = df.รักการอ่าน.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['มีความเป็นตัวของตัวเองสูง'] = df.มีความเป็นตัวของตัวเองสูง.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ขี้ระแวง'] = df.ขี้ระแวง.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['เข้าสังคมเก่ง'] = df.เข้าสังคมเก่ง.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['มีความหนักแน่นมั่นคง'] = df.มีความหนักแน่นมั่นคง.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['เป็นคนสองบุคลิก'] = df.เป็นคนสองบุคลิก.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['รักสวยรักงาม'] = df.รักสวยรักงาม.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ไม่ชอบเที่ยวโลดโผน'] = df.ไม่ชอบเที่ยวโลดโผน.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ไม่ค่อยกล้าแสดงออก'] = df.ไม่ค่อยกล้าแสดงออก.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ใจกว้าง'] = df.ใจกว้าง.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['ขี้เกรงใจคนอื่น'] = df.ขี้เกรงใจคนอื่น.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['มองโลกในหลายแง่มุม'] = df.มองโลกในหลายแง่มุม.replace(['ใช่', 'ไม่ใช่'], [1, 0])
df['เป็นคนโรแมนติก'] = df.เป็นคนโรแมนติก.replace(['ใช่', 'ไม่ใช่'], [1, 0])

x = df[cols]
y = df['ประเภทเกมส์ที่สนใจ']
X_train , X_test , train_y , test_y = train_test_split(x, y, train_size= 0.8, random_state=0)

KNNmodel = KNeighborsClassifier(n_neighbors=20)
KNNmodel = KNNmodel.fit(X_train, train_y)
KNNScore = KNNmodel.score(X_test, test_y)


with open('model.pkl', 'wb') as f:
    pickle.dump(KNNmodel, f)